{
    "villains": [
        {
            "id": 1,
            "name": "Hannibal Lecter",
            "alter-ego": "Dr. Fell",
            "image-url": "",
            "weapon": "Knives",
            "bio": "Dr. Hannibal Lecter is a character created by the American novelist Thomas Harris. Lecter is a serial killer who eats his victims. Before his capture, he was a respected forensic psychiatrist; after his incarceration, he is consulted by FBI agents Will Graham and Clarice Starling to help them find other serial killers",
            "location": "Florence, Italy",
            "age": 90,
            "deceased": false
        },
        {
            "id": 2,
            "name": "Maleficent",
            "alter-ego": "Mistress of Evil",
            "image-url": "",
            "weapon": "Golden Scepter",
            "bio": "Maleficent is a powerful fairy living in the Moors, a magical forest realm bordering a human kingdom. As a child, she meets a human peasant boy named Stefan, and they both fall in love with each other. However, as they get older, the two grow apart, with Stefan's love being overshadowed by his ambition to be a king, while Maleficent becomes the protector of the Moors.",
            "location": "The Moors, Magical Forest",
            "age": 41,
            "deceased": false
        },
        {
            "id": 3,
            "name": "Jack the Ripper",
            "alter-ego": "The Whitechapel Murderer",
            "image-url": "",
            "weapon": "Liston Knife",
            "bio": "Jack the Ripper, pseudonymous murderer of at least five women, in or near London's Whitechapel district, from Aug. 7 to Nov. 10, 1888. Though Jack the Ripper was never apprehended, the killings indicated the murderer had considerable knowledge of human anatomy.",
            "location": "Whitechapel, London",
            "age": 23,
            "deceased": true
        },
        {
            "id": 4,
            "name": "Mystique",
            "alter-ego": "Raven Darkholme",
            "image-url": "",
            "weapon": "Hands",
            "bio": "Mystique's origins remain unknown - her shapeshifting powers mean that her true age remains enigmatic. Her earliest attested appearance dates back to the years around 1900, when she lived in a male guise as a 'consulting detective' who established a romantic relationship with her reality's version of Irene Adler - biographical details which imply she is in fact Sherlock Holmes.",
            "location": "",
            "age": "",
            "deceased": false
        },
        {
            "id": 5,
            "name": "Medusa",
            "alter-ego": "",
            "image-url": "https://cdn4.vectorstock.com/i/1000x1000/60/13/medusa-greek-myth-creature-pop-art-vector-20706013.jpg",
            "weapon": "snakes",
            "bio": "Medusa is a Gorgon found in ancient Greek mythology. Although she is mortal, her hair full of snakes makes her a formidable enemy.",
            "location": "Sarpedon",
            "age": "",
            "deceased": true 
        },
        {
            "id": 6,
            "name": "Erik Killmonger",
            "alter-ego": "N'Jadaka",
            "image-url": "https://media.newyorker.com/photos/5a885dd6bd8b0a0fdacd7808/1:1/w_1078,h_1078,c_limit/StFelix-Black-Panter.jpg",
            "weapon": "Bare hands",
            "bio": "Killmonger is a Wakanda-born supervillain who grew up abroad in the United States. He possesses superior intellect and martial art skills. Killmonger is known for his repeated attempts to battle Black Panther and claim the throne of Wakanda.",
            "location": "Wakanda",
            "age": 33,
            "deceased": true
        },
        {
            "id": 7,
            "name": "Joe Goldberg",
            "alter-ego": "Jonathan Moore",
            "image-url": "https://upload.wikimedia.org/wikipedia/en/thumb/2/21/Penn_Badgley_as_Joe_Goldberg_1.png/220px-Penn_Badgley_as_Joe_Goldberg_1.png",
            "weapon": "Binoculars",
            "bio": "Joe Goldberg is a fictional stalker and serial killer. Joe loves rare books and women he barely knows. Though he recently lived in Los Angeles and London, it is rumored that Joe is back home in NYC. Xoxo.",
            "location": "Manhattan",
            "age": 35,
            "deceased": false
        },
        {
            "id": 8,
            "name": "Michael Myers",
            "alter-ego": "",
            "image-url": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e9/MichaelMyers2018.jpg/220px-MichaelMyers2018.jpg",
            "weapon": "Chef Knife",
            "bio": "Michael Myers is a serial killer from John Carpenter's Halloween films. After escaping Smith's Grove Sanitarium, Myers hunts Laurie Strode for the rest of his life.",
            "location": "Haddonfield, Illinois",
            "age": 66,
            "deceased": false 
        }
    ]   
}
